# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [2]:
import pandas as pd
import numpy as np
import random

C:\Users\rorugan\AppData\Local\Temp\ipykernel_18188\2742571365.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [3]:

a = pd.Series([ 100, 200, 300, 400])

Print a, and data type

In [4]:

a.dtypes

dtype('int64')

Using indexing access the element 300 from the series a.

In [5]:
a[2]

300

What are the values of index for series a?

In [6]:

a.index

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [7]:
a.index=["c","a","b","d"]

Access the value in the series with index 'd'

In [8]:
a["d"]

400

Sort the values wrt to the index and print it

In [9]:


a.sort_index()

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [10]:
b=pd.Series({"e":800,"f":450,"g":100})




b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [11]:
a=pd.concat([a,b])

In [12]:
#print a again after appending b into it


a

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [13]:
a = a.sort_index(ascending=False)
a

g    100
f    450
e    800
d    400
c    100
b    300
a    200
dtype: int64

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [14]:
df =pd.DataFrame(a)
df

     0
g  100
f  450
e  800
d  400
c  100
b  300
a  200

What is the shape of the datafarme <br>
(also, what does it imply?)

In [15]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [16]:
# yep its same as the series.
df.index

Index(['g', 'f', 'e', 'd', 'c', 'b', 'a'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [17]:

df.head

<bound method NDFrame.head of      0
g  100
f  450
e  800
d  400
c  100
b  300
a  200>

In [18]:
df.tail

<bound method NDFrame.tail of      0
g  100
f  450
e  800
d  400
c  100
b  300
a  200>

Rename the column of the dataframe as 'points'

In [19]:

df=df.rename(columns={0:"points"})

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [20]:
#Create fruits array

fruit =np.array(["apple","mango","apple"])

In [21]:
#Create series fruits out of fruits array

fruits =pd.Series([ random.choice(fruit) for i in range(7) ])


fruits

0    apple
1    apple
2    apple
3    mango
4    apple
5    mango
6    mango
dtype: object

Change the index of fruits to the index of dataframe df

In [22]:

fruits.index=df.index
fruits

g    apple
f    apple
e    apple
d    mango
c    apple
b    mango
a    mango
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [23]:
df["fruits"]=fruits
df

   points fruits
g     100  apple
f     450  apple
e     800  apple
d     400  mango
c     100  apple
b     300  mango
a     200  mango

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [24]:
d1 = pd.DataFrame({"city":["Chandigarh","Delhi","kanpur","Chennai","Manali"],
                  "temperature":[15,22,20,26,-2]
})

Print(d1)

In [25]:
d1

         city  temperature
0  Chandigarh           15
1       Delhi           22
2      kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [26]:

d1.shape

(5, 2)

Set city = d1['city']

In [27]:

city=d1["city"]

print city <br>
What is the type of city.

In [28]:

city.dtype

dtype('O')

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [29]:
d2 = pd.DataFrame({ "city":["Bengalaru","Coimbatore","Srirangam","Pondicherry"],
                   "temperature":[24,35,36,39]

})

print the shape of this dataframe

In [30]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [31]:
d3 = pd.concat([d1,d2]).reset_index()


d3
#

   index         city  temperature
0      0   Chandigarh           15
1      1        Delhi           22
2      2       kanpur           20
3      3      Chennai           26
4      4       Manali           -2
5      0    Bengalaru           24
6      1   Coimbatore           35
7      2    Srirangam           36
8      3  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [32]:
d3["temperature"].dtype

dtype('int64')

In [33]:

d3[d3["temperature"]<=20]["city"]

0    Chandigarh
2        kanpur
4        Manali
Name: city, dtype: object

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [34]:
d3[d3["temperature"]>=35]["city"]

6     Coimbatore
7      Srirangam
8    Pondicherry
Name: city, dtype: object

In [35]:
d3

   index         city  temperature
0      0   Chandigarh           15
1      1        Delhi           22
2      2       kanpur           20
3      3      Chennai           26
4      4       Manali           -2
5      0    Bengalaru           24
6      1   Coimbatore           35
7      2    Srirangam           36
8      3  Pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [37]:
  
d3['is_ut'] =d3["city"].apply(lambda x: x in ["Chandigarh","Pondicherry","Delhi"])

In [38]:
# print d3
d3

   index         city  temperature  is_ut
0      0   Chandigarh           15   True
1      1        Delhi           22   True
2      2       kanpur           20  False
3      3      Chennai           26  False
4      4       Manali           -2  False
5      0    Bengalaru           24  False
6      1   Coimbatore           35  False
7      2    Srirangam           36  False
8      3  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [40]:
# write function here


d3["to fahrenheit"]=d3["temperature"].apply(lambda x:(x * 9/5) + 32)


d3

   index         city  temperature  is_ut  to fahrenheit
0      0   Chandigarh           15   True           59.0
1      1        Delhi           22   True           71.6
2      2       kanpur           20  False           68.0
3      3      Chennai           26  False           78.8
4      4       Manali           -2  False           28.4
5      0    Bengalaru           24  False           75.2
6      1   Coimbatore           35  False           95.0
7      2    Srirangam           36  False           96.8
8      3  Pondicherry           39   True          102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [42]:


d3[d3["is_ut"] == True]

   index         city  temperature  is_ut  to fahrenheit
0      0   Chandigarh           15   True           59.0
1      1        Delhi           22   True           71.6
8      3  Pondicherry           39   True          102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [44]:



d3[d3["to fahrenheit"]>90]

   index         city  temperature  is_ut  to fahrenheit
6      1   Coimbatore           35  False           95.0
7      2    Srirangam           36  False           96.8
8      3  Pondicherry           39   True          102.2

Select only the first three rows of the dataframe d1.

In [51]:
d3[:2]

   index        city  temperature  is_ut  to fahrenheit
0      0  Chandigarh           15   True           59.0
1      1       Delhi           22   True           71.6

Select all the rows and last two columns in the dataframe.

In [61]:
d3[:2]

   index        city  temperature  is_ut  to fahrenheit
0      0  Chandigarh           15   True           59.0
1      1       Delhi           22   True           71.6

## Groupby

In [62]:
# Create a dataframe using dictionary of your choice

d3

   index         city  temperature  is_ut  to fahrenheit
0      0   Chandigarh           15   True           59.0
1      1        Delhi           22   True           71.6
2      2       kanpur           20  False           68.0
3      3      Chennai           26  False           78.8
4      4       Manali           -2  False           28.4
5      0    Bengalaru           24  False           75.2
6      1   Coimbatore           35  False           95.0
7      2    Srirangam           36  False           96.8
8      3  Pondicherry           39   True          102.2

In [69]:
# Use Groupby of single column with aggregate sum()


d3.groupby("city")["temperature"].sum()

city
Bengalaru      24
Chandigarh     15
Chennai        26
Coimbatore     35
Delhi          22
Manali         -2
Pondicherry    39
Srirangam      36
kanpur         20
Name: temperature, dtype: int64

In [70]:
# Use Groupby of single column with aggregate count()

d3.groupby("city")["temperature"].count()

city
Bengalaru      1
Chandigarh     1
Chennai        1
Coimbatore     1
Delhi          1
Manali         1
Pondicherry    1
Srirangam      1
kanpur         1
Name: temperature, dtype: int64

In [90]:
# Use Groupby of single column with aggregate min() and max()
# d3.groupby("city")["temperature"].min()
d3.groupby("temperature")["city"].max()

temperature
-2          Manali
 15     Chandigarh
 20         kanpur
 22          Delhi
 24      Bengalaru
 26        Chennai
 35     Coimbatore
 36      Srirangam
 39    Pondicherry
Name: city, dtype: object

In [99]:
# Use Groupby of any 2 columns with aggregate mean()


d3.groupby(["is_ut","city"])["temperature"].mean()

is_ut  city
False  Bengalaru      24.0
       Chennai        26.0
       Coimbatore     35.0
       Manali         -2.0
       Srirangam      36.0
       kanpur         20.0
True   Chandigarh     15.0
       Delhi          22.0
       Pondicherry    39.0
Name: temperature, dtype: float64

In [100]:
# Use Groupby of any 2 columns with aggregate min() and max()

d3.groupby(["is_ut","city"])["temperature"].min()

is_ut  city
False  Bengalaru      24
       Chennai        26
       Coimbatore     35
       Manali         -2
       Srirangam      36
       kanpur         20
True   Chandigarh     15
       Delhi          22
       Pondicherry    39
Name: temperature, dtype: int64